@extends('main')

@section('content')
    <div class="container">
        <div class="row center-cropped" style="background-image: url('{{ URL::asset('image/header_cp.jpg') }}')"></div>
        <div class="row col-md-12" style="background: #ffffff;">
            <div class="well well-lg" style="text-align: center">
                <h1 style="padding: 2%">ประวัติภาควิชาคอมพิวเตอร์</h1>
            </div>

            <div style="font-family: 'Trirong', serif;font-size: 18px;padding: 5% 10% 5% 10%">
                <p style="text-indent: 10%">ภาควิชาคอมพิวเตอร์ แต่เดิมมีฐานะเป็นสาขาวิชาวิทยาการคอมพิวเตอร์ซึ่งสังกัดอยู่ในภาควิชาคณิตศาสตร์ คณะวิทยาศาสตร์ มหาวิทยาลัยศิลปากร เนื่องจากเพื่อก่อให้เกิดเอกภาพและความคล่องตัวในการบริหารและดำเนินการต่างๆ ให้มีประสิทธิภาพมากยิ่งขึ้น จึงได้รับการอนุมัติให้จัดตั้งเป็นภาควิชาคอมพิวเตอร์ สังกัดคณะวิทยาศาสตร์ จากสภามหาวิทยาลัยศิลปากรตั้งแต่วันที่ 8 กันยายน 2547</p>
                <br>
                <p style="text-indent: 10%">ภาควิชาคอมพิวเตอร์ ดำเนินการจัดการเรียนการสอนในศาสตร์ทาง คอมพิวเตอร์และเทคโนโลยีสารสนเทศทั้งด้านฮาร์ดแวร์และซอฟต์แวร์ โดยมุ่งหวังที่จะผลิตบัณฑิตที่มีความรู้ความสามารถเพื่อที่ประกอบอาชีพที่เกี่ยวข้อง กับคอมพิวเตอร์ในแขนงต่างๆ สนองต่อความต้องการของประเทศชาติ ภาควิชาฯ ได้เริ่มเปิดสอนหลักสูตรวิทยาศาสตรบัณฑิต สาขาวิทยาการคอมพิวเตอร์ ในปีการศึกษา 2531 หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิทยาการคอมพิวเตอร์ ในปีการศึกษา 2545 หลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาเทคโนโลยีสารสนเทศ ในปีการศึกษา 2547 และหลักสูตรวิทยาศาสตรบัณฑิต สาขาเทคโนโลยีสารสนเทศ ในปีการศึกษา 2548</p>
                <br>
                <p style="text-indent: 10%">ในอนาคตอันใกล้นี้ ภาควิชาฯ มีโครงการที่จะเปิดสอนในหลักสูตรต่างๆ อีกหลายหลักสูตร ได้แก่ หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิทยาการคอมพิวเตอร์ (หลักสูตรต่อเนื่อง 2 ปี) หลักสูตรวิทยาศาสตรบัณฑิต สาขาเทคโนโลยีสารสนเทศ (หลักสูตรต่อเนื่อง 2 ปี) และหลักสูตรวิทยาศาสตรมหาบัณฑิต สาขาวิศวกรรมซอฟต์แวร์ เป็นต้น</p>
            </div>
        </div>
    </div>
@endsection